//--------------------------------------------------------
// class Game_System
// 处理游戏整体数据
//--------------------------------------------------------
class Game_System{
	//--------------------------------------------------------
	// 初始化,载入数据
	//--------------------------------------------------------
	constructor(static_system){
		for(let attr of Object.keys(static_system)){
			this[attr]=static_system[attr];
		}
	}
	//--------------------------------------------------------
	// 判定是否是自己的回合
	//--------------------------------------------------------
	is_own_turn(){
		return user_index == this.step_list[this.step_index];
	}
	//--------------------------------------------------------
	// 获取本人对应的玩家
	//--------------------------------------------------------
	self_player(){
		return $gamePlayers[user_index];
	}
	//--------------------------------------------------------
	// 获取当前行动中的玩家
	//--------------------------------------------------------
	active_player(){
		return $gamePlayers[this.step_list[this.step_index]];
	}
	//--------------------------------------------------------
	// 同步操作完成人数
	//--------------------------------------------------------
	msg_recive(player_index){
		//每次删除一个已经确认了行动的玩家,如果列表清空,则说明全部行动完成
		var index = this.recive_list.indexOf(player_index);
		//已删除则无视
		if(index!=-1){
			this.recive_list.splice(index,1);
		}		
		return this.recive_list.length==0 || offline;
}

}